{
    "3502": {
        "title": "Commerce",
        "code": "3502",
        "duration": 3,
        "UOC": 144,
        "faculty": "UNSW Business School",
        "overview": "The\nBachelor of Commerce (BCom)\nis a highly valued business qualification offering students a career-focused education for long term success. Students are empowered to become adaptive thinkers and drive purposeful change to thrive in a fast-changing world.\nA unique feature of the BCom is the Integrated First Year, where students learn about business management and the broader environment in which an organisation operates, with a strong focus on developing professional skills and capabilities.\nIn this flexible, diverse and comprehensive business degree, students have exclusive access to\nCareer Accelerator\nan impressive suite of career-boosting opportunities. Completion of at least one for-credit Career Accelerator course is a signature feature of the BCom.\nStudents complete up to two majors, selecting from a comprehensive and industry advised suite, including Accounting, Business Analytics, Economics, Finance, FinTech, HR, Information Systems, International Business, Marketing and Taxation, many fulfilling professional accreditation requirements.\nThe\nmyBCom Series , designed in collaboration with industry and alumni, guides students to develop a personalised roadmap to get the full benefit of the curricular and co-curricular opportunities offered in the BCom. Students graduate with their personal digital myBCom Graduate Portfolio, showcasing their academic, technical and practical career-ready skills and capabilities for a fulfilling career.\nHigh performing students can study an additional Honours year or more advanced postgraduate studies.\nBCom includes:\n1st year (48UOC)\nBusiness Management (24UOC)\nFour courses explore what goes on inside an organisation\nBusiness Ecosystem (12UOC)\nTwo courses consider the broader environment in which an organisation operates\nSkills and Capabilities (12UOC)\nTwo courses build essential skills and capabilities\nmyBCom Blueprint and myBCom First Year Portfolio (0UOC)\nTwo primers to personalise your degree and showcase your achievements\n2nd and 3rd year (96UOC)\n1st Major (48UOC)\nFree Electives or optional 2nd Major or Minor (48UOC)\nMandatory Work-Integrated Learning (6UOC)\nGeneral Education (12UOC)\nFinal Year Synthesis (0-6UOC)\nMyBCom Graduate Portfolio (0UOC)\nThe UNSW Business School difference:\nExclusive access to\nCareer Accelerator\na suite of opportunities for students to complete internships, mentoring, global business practicums, build professional networks and attend industry events\nIntegrated First Year Experience\nimmerse yourself in business problems and opportunities to learn how organisations operate in complex environments and to develop your professional skills\nHighly regarded by industry, with unique\naccreditation\nopportunities\nLearn from leading academics and business experts at a business school with top rankings in Australia across Accounting, Finance, Actuarial Studies and Information Systems\nA comprehensive selection of majors including\nBusiness\nAnalytics\nand\nFinTech\nIncorporates practical real-world experience and global opportunities\nAccess to UNSW Business School s alumni network of 90,000&#43;\nGraduate with a digital\nGraduate Portfolio\nhighlighting your skills and capabilities required for a successful and exciting start to your career",
        "structure_summary": "Students must complete 144 UOC when taken as a standalone program.",
        "components": {
            "general_education": {
                "notes": "Students must take at least 12 UOC of any General Education course.\nPlease note: Students enrolled in programs within the UNSW Business School cannot take General Education courses offered by the UNSW Business School (i.e. GENC code). These restrictions also apply to the following courses:\nGENL2021 An Introduction to the Australian Legal System GENL2032 Cyberspace Law 2.0\nStudents must complete at least 48 UOC before enrolling in General Education courses.",
                "credits_to_complete": 12
            },
            "spec_data": {
                "minors": {
                    "Commerce": {
                        "notes": "Students may choose to use their electives to complete one of the following minors.\nMinor Requirements: An approved disciplinary stream containing at least 18 UOC at Level 2 and Level 3.",
                        "specs": {
                            "ECONO2": "Behavioural Economics",
                            "JAPNF2": "Japanese Studies",
                            "SPANI2": "Spanish Studies",
                            "FINSR2": "Financial Technology",
                            "KOREF2": "Korean Studies",
                            "TABLC2": "Taxation",
                            "CHINE2": "Chinese Studies",
                            "FRENG2": "Advanced French Studies",
                            "MARKA2": "Marketing",
                            "COMMJ2": "Business Analytics",
                            "IBUSA2": "International Business",
                            "MGMTH2": "Human Resource Management",
                            "FINSA2": "Finance",
                            "JAPNG2": "Advanced Japanese Studies",
                            "TABLA2": "Business Law",
                            "ACCTA2": "Accounting",
                            "FRENF2": "French Studies",
                            "KOREG2": "Advanced Korean Studies",
                            "CHINF2": "Advanced Chinese Studies",
                            "GERSF2": "German Studies",
                            "MGMTA2": "Management",
                            "ECONF2": "Business Economics",
                            "INFSA2": "Information Systems",
                            "MGMTJ2": "Innovation, Strategy and Entrepreneurship"
                        }
                    }
                },
                "majors": {
                    "Commerce": {
                        "notes": "Students must complete a 48 UOC within a specified discipline (Commerce major) with at least 18 UOC of Level 3 courses to meet program requirements. Please note, this 48 UOC includes 1 course from the Integrated First Year (IFY) core. This means that students will complete 42 UOC in specified disciplinary courses outside the IFY core.",
                        "specs": {
                            "INFSA1": "Information Systems",
                            "COMMJ1": "Business Analytics",
                            "MGMTH1": "Human Resource Management",
                            "ECONO1": "Behavioural Economics",
                            "TABLC1": "Taxation",
                            "FINSR1": "Financial Technology",
                            "ACCTA1": "Accounting",
                            "MARKA1": "Marketing",
                            "ECONF1": "Business Economics",
                            "MGMTJ1": "Innovation, Strategy and Entrepreneurship",
                            "FINSA1": "Finance",
                            "IBUSA1": "International Business"
                        }
                    }
                }
            },
            "core_courses": [
                {
                    "courses": {
                        "COMM2233": "Industry Consulting Project",
                        "INFS3020": "International Information Systems and Technology Practicum",
                        "COMM3020": "Global Business Practicum",
                        "TABL3033": "UNSW Tax and Business Advisory Clinic",
                        "COMM3090": "Synthesis of Learning Experience",
                        "ACCT3583": "Management Accounting 2",
                        "COMM3900": "Capstone Project",
                        "COMM2244": "Future of Work Project",
                        "MGMT3004": "Solving Complex Strategy and Policy Problems",
                        "COMM3030": "Social Entrepreneurship Practicum",
                        "COMM3501": "Quantitative Business Analytics",
                        "ACTL3192": "Retirement Saving and Spending Over the Lifecycle",
                        "ECON3000": "Evidence-based Intervention Design and Evaluation"
                    },
                    "title": "Final Year Synthesis",
                    "credits_to_complete": 6,
                    "levels": [],
                    "notes": "Students must complete either a 6 UOC Synthesis of Learning Course, or a 0 UOC Synthesis Experience.\nStudents who complete a Synthesis course that is also a Work Integrated Learning course within a major, will meet a major elective, WIL and Synthesis requirement.\nStudents must complete their Final Year Synthesis course within their final year of their Bachelor of Commerce program. That is, within 48 UOC or less remaining in their BCom program."
                },
                {
                    "courses": {
                        "COMM3999": "myBCom Graduation Portfolio",
                        "COMM0999": "myBCom Blueprint",
                        "COMM1999": "myBCom First Year Portfolio"
                    },
                    "title": "myBCom",
                    "credits_to_complete": 0,
                    "levels": [],
                    "notes": "Students need to complete three non-credit bearing myBCom professional development elements. COMM0999 is recommended to be enrolled in the first term of study, COMM1999 upon completion of the integrated first year courses and COMM3999 in the final term of study. Students will engage in course Moodle activities as well as the myBCom platform (https://mybcom.unsw.edu.au/) to complete these elements."
                },
                {
                    "courses": {
                        "COMM1120": "Collaboration and Innovation in Business",
                        "COMM1150": "Global Business Environments",
                        "COMM1180": "Value Creation",
                        "COMM1100": "Business Decision Making",
                        "COMM1140": "Financial Management",
                        "COMM1170": "Organisational Resources",
                        "COMM1190": "Data, Insights and Decisions",
                        "COMM1110": "Evidence-Based Problem Solving"
                    },
                    "title": "Integrated First Year Courses",
                    "credits_to_complete": 48,
                    "levels": [],
                    "notes": "Students must take 48 UOC of the following courses."
                }
            ],
            "information_rules": [
                {
                    "title": "LEVEL 2 AND 3 MATURITY REQUIREMENTS",
                    "notes": "Student must have completed 24 UOC before taking any level 2 courses. Student must have completed 48 UOC before taking any level 3 courses."
                },
                {
                    "title": "Double Majors",
                    "notes": "If a student chooses to complete 2 commerce majors and the majors have a Integrated First Year (IFY) core course in common, they are permitted to double count a maximum of 6 UOC of this overlap unless specified otherwise.\nStudents completing a major sequence with courses in common which are not part of the IFY courses may only count the overlap towards one major and must replace this course within the other major with a major elective of the same level or higher (e.g. Level 3 core course for a Level 3 major elective)."
                }
            ],
            "limit_rules": [
                {
                    "courses": {
                        "GENC": "any UNSW Business School course"
                    },
                    "title": "Minimum Faculty UOC",
                    "credits_to_complete": 96,
                    "levels": [],
                    "notes": "Students must complete a minimum of 96 UOC of the following courses."
                }
            ],
            "prescribed_electives": [
                {
                    "courses": {
                        "COMM2244": "Future of Work Project",
                        "COMM3030": "Social Entrepreneurship Practicum",
                        "COMM3202": "Industry Experience Placement 2",
                        "COMM2222": "Industry Experience Program",
                        "COMM3020": "Global Business Practicum",
                        "COMM3101": "Industry Experience Placement 1",
                        "CDEV3000": "Practice of Work",
                        "TABL3033": "UNSW Tax and Business Advisory Clinic",
                        "COMM2233": "Industry Consulting Project"
                    },
                    "title": "Prescribed Work Integrated Learning (WIL) Course",
                    "credits_to_complete": 6,
                    "levels": [],
                    "notes": "Students must complete a 6 UOC Work Integrated Learning (WIL) course within their program. This course can count as a free elective or where applicable, can count as a Commerce major elective or General Education course. Note: Students in Commerce Double Degrees have the option of meeting the mandatory WIL requirement in the non-Commerce component of the Double Degree."
                }
            ],
            "other": []
        },
        "processing_warnings": [
            "Couldn't find the number of credits for item in program Commerce (3502) in section titled 'myBCom'"
        ]
    },
    "3673": {
        "title": "Economics / Computer Science",
        "code": "3673",
        "duration": 4,
        "UOC": 192,
        "faculty": "UNSW Business School",
        "overview": "This program allows students to study a double degree in both Economics and Computer Science. There are practical applications in combining such majors as Econometrics with the discipline of computer science. This program has an extensive range of majors in both economics (3) and computer science (8). An honours year in economics or computer science is possible for high-achieving students\nfollowing completion of this program.",
        "structure_summary": "Students must complete 192 UOC.\n\nEconomics\n\n\nIntroductory Business Course (6 UOC)\nEconomics Core Courses (48 UOC)\nEconomics Electives (30 UOC)\nBusiness Electives (12 UOC)\n\nStudents may choose to use their Economics core and elective courses to complete an optional Economics major. Courses for the major are taken once but also meet core and elective course rules where listed.\n\nComputer Science\n\n\nA Bachelor of Computer Science Major (96 UOC)",
        "components": {
            "general_education": {},
            "spec_data": {
                "majors": {
                    "null": {
                        "notes": "COMPA1 is the default stream, and will be used if no other stream is selected.",
                        "specs": {
                            "COMPI1": "Computer Science (Artificial Intelligence)",
                            "COMPD1": "Computer Science (Database Systems)",
                            "COMPJ1": "Computer Science (Programming Languages)",
                            "COMPA1": "Computer Science",
                            "COMPE1": "Computer Science (eCommerce Systems)",
                            "COMPS1": "Computer Science (Embedded Systems)",
                            "COMPY1": "Computer Science (Security Engineering)",
                            "COMPN1": "Computer Science (Computer Networks)"
                        }
                    },
                    "Economics": {
                        "notes": "Students may choose to complete one or two optional Economics majors.\nStudents may use their Economics Core and Economics Elective courses to complete these economics majors. Please note: If you choose to study two optional Economics majors, you must choose another 6 courses (36 UOC) from the second major that do not overlap with the first optional major.",
                        "specs": {
                            "ECONT1": "Data Analytics and Econometrics",
                            "ECONU1": "Economic Policy and Society",
                            "ECONV1": "Macroeconomics and Financial Markets"
                        }
                    }
                }
            },
            "core_courses": [
                {
                    "courses": {
                        "ECON1203": "Business and Economic Statistics",
                        "ECON2101": "Microeconomics 2",
                        "ECON1101": "Microeconomics 1",
                        "ECON2206": "Introductory Econometrics ",
                        "ECON1401": "Economic Perspectives",
                        "ECON1202": "Quantitative Analysis for Business and Economics",
                        "ECON1102": "Macroeconomics 1",
                        "ECON2102": "Macroeconomics 2"
                    },
                    "title": "Economics Core",
                    "credits_to_complete": 48,
                    "levels": [],
                    "notes": "Students must take 48 UOC of the following courses."
                }
            ],
            "information_rules": [
                {
                    "title": "Special Arrangements for Mathematics and Economics Courses",
                    "notes": "Students should do the MATH courses which are required in the Computer Science specialisation , ie MATH1131/MATH1141 & MATH1231/MATH1241. These courses will substitute for Economics courses in your major as follows:- MATH1131/MATH1141 will substitute for ECON1202. MATH1231/MATH1241 will substitute for ECON1203. Students have the option of counting the MATH pair of courses towards the Computer Science component and must complete 2 additional Economics electives (4 in total); OR towards the Economics component and must complete 2 additional Computer Science electives."
                },
                {
                    "title": "Maximum Level 1 UOC",
                    "notes": "No more than 60 UOC in Level 1 courses will be counted towards the Economics component of the double degree"
                },
                {
                    "title": "Level 3 Maturity Requirements",
                    "notes": "Students must have completed all Level 1 ECON courses prescribed in the degree before taking any Level 3 ECON courses."
                }
            ],
            "limit_rules": [
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 Electives UOC",
                    "credits_to_complete": 60,
                    "levels": [],
                    "notes": "Students may only undertake a maximum of 60 UOC of the following courses."
                }
            ],
            "prescribed_electives": [
                {
                    "courses": {
                        "COMM1140": "Financial Management",
                        "COMM1900": "Organisations in Their Environment",
                        "COMM1190": "Data, Insights and Decisions",
                        "COMM1120": "Collaboration and Innovation in Business"
                    },
                    "title": "Introductory Business Course",
                    "credits_to_complete": 6,
                    "levels": [],
                    "notes": "Students must take 6 UOC of the following courses.\nPlease Note:\nThe below courses cannot be counted towards an Economics major."
                },
                {
                    "courses": {
                        "ECON2": "any level 2 Economics course",
                        "ECON3": "any level 3 Economics course",
                        "ACTL3192": "Retirement Saving and Spending Over the Lifecycle",
                        "ACTL3191": "Superannuation and Retirement Benefits"
                    },
                    "title": "Economics Electives",
                    "credits_to_complete": 30,
                    "levels": [],
                    "notes": "Students must take 30 UOC of the following courses with at least 18 UOC of level 3 Economics courses."
                },
                {
                    "courses": {
                        "GENC": "any course offered by UNSW Business School"
                    },
                    "title": "UNSW Business Electives",
                    "credits_to_complete": 12,
                    "levels": [],
                    "notes": "Students must complete 12 UOC of Business School electives. Students are encouraged to select a Work-Integrated Learning course as one of their Business School elective courses - e.g., COMM3020, COMM3030, COMM3101, or COMM3202."
                }
            ],
            "other": []
        },
        "processing_warnings": [
            "Couldn't find any of names (Computer Science) or (Economics) in program Economics / Computer Science (3673) in section titled 'Disciplinary Component'",
            "Couldn't find any of names (Computer Science) or (Economics) in program Economics / Computer Science (3673) in section titled 'Maximum Level 1 Electives UOC'",
            "Couldn't find any of names (Computer Science) or (Economics) in program Economics / Computer Science (3673) in section titled 'Majors'"
        ]
    },
    "3674": {
        "title": "Actuarial Studies / Computer Science",
        "code": "3674",
        "duration": 4,
        "UOC": 192,
        "faculty": "UNSW Business School",
        "overview": "This program combines the strengths of Actuarial Studies and Computer Science and allows high-performing students the opportunity to study a quantitative program with practical applications in computer science. This 4-year program will allow students to combine advanced studies in mathematics, economics, insurance, finance, statistics and programming.",
        "structure_summary": "Students must complete 192 UOC.\nActuarial Studies component (96 UOC)\n\nLevel 1 Actuarial Studies Core Courses (48 UOC)\n\nLevel 2 Actuarial Studies Core Courses (18 UOC) (Please note: ACTL2131 may be substituted by MATH2901 and MATH2931, please see below)\nLevel 3 Actuarial Studies Electives (24 UOC)\nBusiness School Elective (6 UOC)\n\nBachelor of Computer Science (96 UOC)\n\nAn approved Bachelor of Computer Science major.\n\nPlease note: MATH1151 and MATH1251 are completed under the Actuarial Studies component of the Double Degree, and replace (MATH1131 or MATH1141) and (MATH1231 or MATH1241) in the Computer Science component.",
        "components": {
            "general_education": {},
            "spec_data": {
                "majors": {
                    "Actuarial Studies": {
                        "notes": "Students may elect to complete ACTLE1 or MATHE1 in addition to their Actuarial Studies program requirements.\nStudents completing these majors will still need to complete the program requirements such as Level 1 and 2 core course as well as Level 3 electives.\nThese majors will require UOC to be taken from the Business Electives, Free elective and/or General Education courses depending on a students program rules and courses completed. It may also require completion of additional UOC above the minimum required for a student's program. Please see the Progression Plans and consult the Business School Student Centre if you are interested in completing either of these majors.",
                        "specs": {
                            "MATHE1": "Quantitative Data Science",
                            "ACTLE1": "Actuarial Risk Management and Analytics"
                        }
                    },
                    "Computer Science": {
                        "notes": "COMPA1 is the default stream, and will be used if no other stream is selected.",
                        "specs": {
                            "COMPJ1": "Computer Science (Programming Languages)",
                            "COMPS1": "Computer Science (Embedded Systems)",
                            "COMPD1": "Computer Science (Database Systems)",
                            "COMPN1": "Computer Science (Computer Networks)",
                            "COMPI1": "Computer Science (Artificial Intelligence)",
                            "COMPY1": "Computer Science (Security Engineering)",
                            "COMPE1": "Computer Science (eCommerce Systems)",
                            "COMPA1": "Computer Science"
                        }
                    }
                }
            },
            "core_courses": [
                {
                    "courses": {
                        "COMM1180": "Value Creation",
                        "MATH1151": "Mathematics for Actuarial Studies and Finance 1A",
                        "COMM1140": "Financial Management",
                        "ACTL1101": "Introduction to Actuarial Studies",
                        "MATH1251": "Mathematics for Actuarial Studies and Finance 1B",
                        "COMM1170": "Organisational Resources",
                        "ECON1101": "Microeconomics 1",
                        "ECON1102": "Macroeconomics 1"
                    },
                    "title": "Level 1 Core Courses",
                    "credits_to_complete": 48,
                    "levels": [],
                    "notes": "Students must take 48 UOC of the following courses."
                },
                {
                    "courses": {
                        "ACTL2131": "Probability and Mathematical Statistics",
                        "ACTL2111": "Financial Mathematics for Actuaries",
                        "COMM2501": "Data Visualisation and Communication",
                        "ACTL2102": "Foundations of Actuarial Models"
                    },
                    "title": "Level 2 Core Courses",
                    "credits_to_complete": 24,
                    "levels": [],
                    "notes": "Students must take 24 UOC of the following courses.\nStudents may replace ACTL2131 with the two courses MATH2901 Higher Theory of Statistics and MATH2931 Higher Linear Models. If students make this replacement, MATH2901 will count towards ACTL2131, and MATH2931 will be counted towards a major where this course is required or as a Business elective."
                }
            ],
            "information_rules": [
                {
                    "title": "Note for students choosing to complete an Actuarial Studies major",
                    "notes": "Students completing an Actuarial Studies major and an additional major/minor will result in more UOC required for degree completion."
                },
                {
                    "title": "3674 Actuarial Studies / Computer Science Specific Information",
                    "notes": "MATH1151 & MATH1251 are compulsory core courses that count towards the Bachelor of Computer Science. Students must complete an additional 12 UOC of UNSW Business School electives to complete the requirement for 96 UOC of Business School courses.\n1. MATH1151 Mathematics for Actuarial Studies and Finance 1A (6 UOC) replaces the Computer Science requirement to complete MATH1131 Mathematics 1A or MATH1141 Higher Mathematics 1A (6 UOC) 2. MATH1251 Mathematics for Actuarial Studies and Finance 1B (6 UOC) replaces the Computer Science requirement to complete MATH1231 Mathematics 1B or MATH1241 Higher Mathematics 1B This applies to any stream that requires either of these courses."
                }
            ],
            "limit_rules": [
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 Electives UOC",
                    "credits_to_complete": 60,
                    "levels": [],
                    "notes": "Students may only undertake a maximum of 60 UOC of the following courses."
                }
            ],
            "prescribed_electives": [
                {
                    "courses": {
                        "ACTL3142": "Statistical Machine Learning for Risk and Actuarial Applications",
                        "ACTL3182": "Asset-Liability and Derivative Models",
                        "ACTL3141": "Modelling and Prediction of Life and Health Related Risks",
                        "ACTL3143": "Artificial Intelligence and Deep Learning Models for Actuarial Applications",
                        "ACTL3301": "Quantitative Risk Management",
                        "ACTL3151": "Actuarial Mathematics for Insurance and Superannuation",
                        "ACTL3192": "Retirement Saving and Spending Over the Lifecycle",
                        "ACTL3191": "Superannuation and Retirement Benefits",
                        "ACTL3162": "General Insurance Techniques"
                    },
                    "title": "Level 3 Actuarial Electives",
                    "credits_to_complete": 24,
                    "levels": [],
                    "notes": "Students must complete 24 UOC of the following courses."
                }
            ],
            "other": []
        },
        "processing_warnings": []
    },
    "3778": {
        "title": "Computer Science",
        "code": "3778",
        "duration": 3,
        "UOC": 144,
        "faculty": "Faculty of Engineering",
        "overview": "Computer Science involves the study of the design, construction and uses of computer systems. It is concerned with the representation of data and data structures in computer systems and the design of algorithms for automatic manipulation of this information by programming languages and machine systems. It is very much concerned with the design and development of hardware and software tools by which computer applications may be developed, but not so much with the applications themselves. It is, however, noted that non-computing elements (such as human interface or psychological aspects) can often dictate the level of success of computing systems. At UNSW, particular emphasis is given to comprehension of the basic principles behind computing tools, operating systems, compilers and translators, and computer hardware.",
        "structure_summary": "Students must complete 144 UOC when taken as a standalone program.\n\nComplete a 96 UOC CS major\n\n36 UOC of Free Electives - students can also choose to undertake an optional minor or a combination of an optional minor and Free Electives to fulfil this requirement\n12 UOC of General Education",
        "components": {
            "general_education": {
                "notes": "Students must take 12 UOC of any General Education course.\nNOTE: Students are encouraged to complete 48 UOC before taking any General Education course.",
                "credits_to_complete": 12
            },
            "spec_data": {
                "minors": {
                    "Computer Science": {
                        "notes": "Optional minors available include the following. If you complete a minor of 30 UOC, you will also need to take 6 UOC of free electives.",
                        "specs": {
                            "INFSA2": "Information Systems",
                            "FINSA2": "Finance",
                            "ACCTA2": "Accounting",
                            "PSYCM2": "Psychology",
                            "MATHC2": "Mathematics",
                            "MARKA2": "Marketing"
                        }
                    }
                },
                "majors": {
                    "Computer Science": {
                        "notes": "COMPA1 is the default stream, and will be used if no other stream is selected.",
                        "specs": {
                            "COMPA1": "Computer Science",
                            "COMPY1": "Computer Science (Security Engineering)",
                            "COMPN1": "Computer Science (Computer Networks)",
                            "COMPS1": "Computer Science (Embedded Systems)",
                            "COMPJ1": "Computer Science (Programming Languages)",
                            "COMPI1": "Computer Science (Artificial Intelligence)",
                            "COMPE1": "Computer Science (eCommerce Systems)",
                            "COMPD1": "Computer Science (Database Systems)"
                        }
                    }
                }
            },
            "core_courses": [],
            "information_rules": [],
            "limit_rules": [
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 Electives UOC",
                    "credits_to_complete": 60,
                    "levels": [],
                    "notes": "Students may only undertake a maximum of 60 UOC of the following courses."
                }
            ],
            "prescribed_electives": [],
            "other": []
        },
        "processing_warnings": []
    },
    "3781": {
        "title": "Advanced Mathematics (Honours) / Computer Science",
        "code": "3781",
        "duration": 5,
        "UOC": 240,
        "faculty": "Faculty of Science",
        "overview": "The Faculty of Science and the Faculty of Engineering offer a dual degree program leading to the award of the degrees Bachelor of Science (Advanced Mathematics)(Honours) and Bachelor of Science (Computer Science). The typical duration of this program is 5 years full-time.\nThe Advanced Mathematics (Honours) and Computer Science degrees lend themselves well to each other. While the Advanced Mathematics (Honours) degree focuses on an in-depth understanding of pure and applied mathematics, the computer science degree looks at the design, construction and uses of computer systems. Your mathematics study will assist with the manipulation of data as well as the development of algorithms in computer science. There is no better degree to combine your passion for mathematics as well as computer systems.",
        "structure_summary": "Students must complete 240 UOC.\nBachelor of Advanced Mathematics (Honours) (144 UOC)\n\nAn approved Advanced Mathematics (Honours) major; and\nSCIF1131;\n48 units of credit Honours Year; and\nScience elective courses\n\n\nBachelor of Science (Computer Science) (96 UOC)\n\nA Bachelor of Computer Science major; and\nComputer Science elective courses\n\nIn this dual degree students take 144 UOC for the Bachelor of Advanced Mathematics, and 96 UOC for the Bachelor of Science (Computer Science), for a total of 240 UOC. The Science courses required for both degrees can overlap. Depending on the chosen combination of Computer Science major and Advanced Mathematics major there may be varying amounts of overlapping courses. When a student meets all the requirements for both degrees in less than 240 UOC, students must complete additional elective courses to bring the total to 240 UOC. Those electives must be taken from the Faculty of Engineering and/or the Faculty of Science.\n\nIn some cases, course overlaps will require students to replace the usual course in one core or major with a more advanced course required in the other program. Specifically:\n- Students must complete MATH1141 and MATH1241 or higher versions.",
        "components": {
            "general_education": {},
            "spec_data": {
                "majors": {
                    "Computer Science": {
                        "notes": "COMPA1 is the default stream, and will be used if no other stream is selected.",
                        "specs": {
                            "COMPY1": "Computer Science (Security Engineering)",
                            "COMPS1": "Computer Science (Embedded Systems)",
                            "COMPI1": "Computer Science (Artificial Intelligence)",
                            "COMPJ1": "Computer Science (Programming Languages)",
                            "COMPE1": "Computer Science (eCommerce Systems)",
                            "COMPN1": "Computer Science (Computer Networks)",
                            "COMPD1": "Computer Science (Database Systems)",
                            "COMPA1": "Computer Science"
                        }
                    },
                    "Advanced Mathematics (Honours)": {
                        "notes": "Students must complete exactly one approved Bachelor of Science (Advanced Mathematics) (Honours) major, and this must be declared before enrolling in Level III courses. Students cannot undertake a double major in this program.",
                        "specs": {
                            "MATHA1": "Applied Mathematics",
                            "MATHU1": "Advanced Statistics",
                            "MATHP1": "Pure Mathematics"
                        }
                    }
                },
                "honours": {
                    "Advanced Mathematics (Honours)": {
                        "notes": "Students must complete at least one of the specialisations below.",
                        "specs": {
                            "MATHPH": "Pure Mathematics",
                            "MATHAH": "Applied Mathematics",
                            "MATHTH": "Statistics"
                        }
                    }
                }
            },
            "core_courses": [
                {
                    "courses": {
                        "SCIF1131": "Introductory Skills for Science"
                    },
                    "title": "Level 1 Core Course",
                    "credits_to_complete": 6,
                    "levels": [],
                    "notes": "Students must take the following course."
                }
            ],
            "information_rules": [
                {
                    "title": "3781 - COMP COURSE RULE",
                    "notes": "Students may not count 'COMP' courses towards their Science requirements unless they are specified as core courses in their major (i.e. for these students 'COMP' courses will not count as 'Science' courses)."
                }
            ],
            "limit_rules": [
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 Electives UOC",
                    "credits_to_complete": 60,
                    "levels": [],
                    "notes": "Students may only undertake a maximum of 60 UOC of the following courses."
                },
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 UOC",
                    "credits_to_complete": 72,
                    "levels": [],
                    "notes": "A maximum of 72 UOC of Level 1 courses can be taken, including any General Education or mainstream Level 1 course taken to fulfil either the General Education or the Free Elective requirement."
                },
                {
                    "courses": {
                        "AVIA3": "any level 3 Faculty of Science course",
                        "BABS3": "any level 3 Faculty of Science course",
                        "BEES3": "any level 3 Faculty of Science course",
                        "BIOC3": "any level 3 Faculty of Science course",
                        "BIOS3": "any level 3 Faculty of Science course",
                        "CHEM3": "any level 3 Faculty of Science course",
                        "CLIM3": "any level 3 Faculty of Science course",
                        "DATA3": "any level 3 Faculty of Science course",
                        "GENS3": "any level 3 Faculty of Science course",
                        "GEOS3": "any level 3 Faculty of Science course",
                        "MATH3": "any level 3 Faculty of Science course",
                        "MATS3": "any level 3 Faculty of Science course",
                        "MICR3": "any level 3 Faculty of Science course",
                        "MSCI3": "any level 3 Faculty of Science course",
                        "NANO3": "any level 3 Faculty of Science course",
                        "PHYS3": "any level 3 Faculty of Science course",
                        "PSYC3": "any level 3 Faculty of Science course",
                        "SCIF3": "any level 3 Faculty of Science course",
                        "ANAT3": "any level 3 Anatomy course",
                        "NEUR3": "any level 3 Neuroscience course",
                        "PATH3": "any level 3 Pathology course",
                        "PHAR3": "any level 3 Pharmacology course",
                        "PHSL3": "any level 3 Physiology course",
                        "FOOD3": "any level 3 Food Technology course",
                        "COMP3": "any level 3 Computer Science course",
                        "SOMS3": "any level 3 Medical Science course"
                    },
                    "title": "Minimum Level 3 Science Courses",
                    "credits_to_complete": 30,
                    "levels": [],
                    "notes": "Students must complete a minimum of 30 UOC of the following courses."
                },
                {
                    "courses": {
                        "AVIA1": "any level 1 Faculty of Science course",
                        "BABS1": "any level 1 Faculty of Science course",
                        "BEES1": "any level 1 Faculty of Science course",
                        "BIOC1": "any level 1 Faculty of Science course",
                        "BIOS1": "any level 1 Faculty of Science course",
                        "CHEM1": "any level 1 Faculty of Science course",
                        "CLIM1": "any level 1 Faculty of Science course",
                        "DATA1": "any level 1 Faculty of Science course",
                        "GENS1": "any level 1 Faculty of Science course",
                        "GEOS1": "any level 1 Faculty of Science course",
                        "MATH1": "any level 1 Faculty of Science course",
                        "MATS1": "any level 1 Faculty of Science course",
                        "MICR1": "any level 1 Faculty of Science course",
                        "MSCI1": "any level 1 Faculty of Science course",
                        "NANO1": "any level 1 Faculty of Science course",
                        "PHYS1": "any level 1 Faculty of Science course",
                        "PSYC1": "any level 1 Faculty of Science course",
                        "SCIF1": "any level 1 Faculty of Science course",
                        "COMP1": "any level 1 Computer Science course",
                        "FOOD1": "any level 1 Food Technology course",
                        "ANAT1": "any level 1 Anatomy course",
                        "NEUR1": "any level 1 Neuroscience course",
                        "PATH1": "any level 1 Pathology course",
                        "PHAR1": "any level 1 Pharmacology course",
                        "PHSL1": "any level 1 Physiology course"
                    },
                    "title": "Minimum Level 1 Science Courses",
                    "credits_to_complete": 24,
                    "levels": [],
                    "notes": "Students must complete a minimum of 24 UOC of the following courses."
                }
            ],
            "prescribed_electives": [
                {
                    "courses": {
                        "MSCI": "any Faculty of Science course",
                        "BIOT": "any Biotechnology course",
                        "BEES": "any Faculty of Science course",
                        "MATH": "any Faculty of Science course",
                        "PHAR": "any Pharmacology course",
                        "CLIM": "any Faculty of Science course",
                        "AVIA": "any Aviation course",
                        "BABS": "any Biotechnology & Biomolecular Sciences course",
                        "BIOC": "any Biochemistry course",
                        "BIOS": "any Biological Science course",
                        "CHEM": "any Chemistry course",
                        "DATA": "any Data Science course",
                        "GENS": "any Faculty of Science course",
                        "GEOS": "any Geoscience course",
                        "MATS": "any Materials Science and Engineering course",
                        "MICR": "any Microbiology course",
                        "NANO": "any Faculty of Science course",
                        "PHYS": "any Physics course",
                        "PSYC": "any Psychology course",
                        "SCIF": "any Faculty of Science course",
                        "PHSL": "any Physiology course",
                        "OPTM": "any Optometry course",
                        "SOMS": "any Medical Science course",
                        "NEUR": "any Neuroscience course",
                        "PATH": "any Pathology course",
                        "FOOD": "any Food Technology course",
                        "VISN": "any Vision Science course",
                        "ANAT": "any Anatomy course"
                    },
                    "title": "Science Electives",
                    "credits_to_complete": 6,
                    "levels": [],
                    "notes": "Students must take 'science' courses so that the major plus SCIF1131, plus Honours year plus 'science' courses total 144 units of credit."
                }
            ],
            "other": []
        },
        "processing_warnings": [
            "Couldn't find any of names (Advanced Mathematics (Honours)) or (Computer Science) in program Advanced Mathematics (Honours) / Computer Science (3781) in section titled '3781 - COMP COURSE RULE'"
        ]
    },
    "3782": {
        "title": "Advanced Science (Honours) / Computer Science",
        "code": "3782",
        "duration": 5,
        "UOC": 240,
        "faculty": "Faculty of Science",
        "overview": "The Faculty of Science and the Faculty of Engineering offer a dual degree program leading to the award of the degrees Bachelor of Science (Advanced) and Bachelor of Science (Computer Science). The typical duration of this program is 5 years full-time.\nThe Bachelor of Advanced Science (Honours) is the degree of choice for innovative thinkers with exceptional scientific knowledge and skills. It&#39;s designed for talented students and offers the flexibility to tailor the degree in a way that works for them. The degree offers students access to advanced level courses and includes an Honours year.\nThe Bachelor of Science (Computer Science) focuses on the design and development of hardware and software tool by which computer applications may be developed. By combining your passion for science and the computer sciences you could further develop applications for use within the scientific world.",
        "structure_summary": "Students must complete 240 UOC.\nBachelor of Advanced Science (Honours) (144 UOC)\n\nAn approved Bachelor of Advanced Science (Honours) major; and\nSCIF1131;\n48 units of credit Honours Year; and\nScience elective courses\n\nBachelor of Science (Computer Science) (96 UOC)\n\nA Bachelor of Computer Science major; and\nComputer Science elective courses\n\nIn this dual degree students take 144 UOC for the Bachelor of Advanced Science (Honours), and 96 UOC for the Bachelor of Science (Computer Science), for a total of 240 UOC. The Science courses required for both degrees can overlap. Depending on the chosen combination of Computer Science major and Advanced Science (Honours) major there may be varying amounts of overlapping courses. When a student meets all the requirements for both degrees in less than 240 UOC, students must complete additional elective courses to bring the total to 240 UOC. Those electives must be taken from the Faculty of Engineering and/or the Faculty of Science.\nIn some cases, course overlaps will require students to replace the usual course in one core or major with a more advanced course required in the other program. Specifically:\n\n- Students must complete MATH1141 and MATH1241 or higher versions.",
        "components": {
            "general_education": {},
            "spec_data": {
                "majors": {
                    "Advanced Science (Honours)": {
                        "notes": "Students must complete at least one Science major selected from the list below.\nWhen offered in a particular major, students must take higher versions of any Level 2 or 3 courses. Any variation to this must be approved by the Associate Dean (Academic Programs) or nominee.\nBioinformatics is a 96 UOC major, students will not be able to complete this major as part of a double degree within the minimum UOC. This major will involve extra time and costs to meet the degree requirements and may have visa implications for international students. Contact the Science Student Centre for more details.",
                        "specs": {
                            "BIOCL1": "Molecular and Cell Biology",
                            "PHSLB1": "Physiology",
                            "MICRJ1": "Immunology",
                            "CLIMB1": "Climate Systems Science",
                            "MATHO1": "Advanced Physical Oceanography",
                            "PHARB1": "Pharmacology",
                            "BINFB1": "Bioinformatics",
                            "BIOSG1": "Ecology",
                            "PHYSC1": "Advanced Physics",
                            "CLIMC1": "Climate Dynamics",
                            "MATHK1": "Statistics",
                            "MICRE1": "Microbiology",
                            "BIOCG1": "Genetics",
                            "MATHJ1": "Mathematics",
                            "BIOSJ1": "Biology",
                            "BIOTB1": "Biotechnology",
                            "MSCIM1": "Marine and Coastal Science",
                            "PSYCA1": "Psychology",
                            "PATHB1": "Pathology",
                            "GEOLS1": "Earth Science",
                            "VISNA1": "Vision Science",
                            "MATSB1": "Materials Science",
                            "NEURA1": "Neuroscience",
                            "CHEMB1": "Chemistry",
                            "GEOGG1": "Geography",
                            "ANATA1": "Anatomy"
                        }
                    },
                    "Computer Science": {
                        "notes": "COMPA1 is the default stream, and will be used if no other stream is selected.",
                        "specs": {
                            "COMPJ1": "Computer Science (Programming Languages)",
                            "COMPE1": "Computer Science (eCommerce Systems)",
                            "COMPD1": "Computer Science (Database Systems)",
                            "COMPA1": "Computer Science",
                            "COMPY1": "Computer Science (Security Engineering)",
                            "COMPS1": "Computer Science (Embedded Systems)",
                            "COMPN1": "Computer Science (Computer Networks)",
                            "COMPI1": "Computer Science (Artificial Intelligence)"
                        }
                    }
                },
                "minors": {
                    "Advanced Science (Honours)": {
                        "notes": "Students may choose to complete an optional minor in one of the following areas, using their Science and/or free electives",
                        "specs": {
                            "GEOLF2": "Geology",
                            "BIOSD2": "Biology",
                            "PHYSC2": "Physics",
                            "PSYCM2": "Psychology",
                            "MATHC2": "Mathematics",
                            "MSCIH2": "Marine Science",
                            "ANATB2": "Anatomy",
                            "ARCYB2": "Palaeosciences",
                            "BIOCD2": "Molecular Biology",
                            "MICRJ2": "Immunology",
                            "CHEMD2": "Chemistry",
                            "PATHB2": "Pathology",
                            "PHARB2": "Pharmacology",
                            "MATHD2": "Statistics",
                            "PHSLB2": "Physiology",
                            "CLIMA2": "Climate Science",
                            "GEOGH2": "Physical Geography",
                            "VISNB2": "Vision Science"
                        }
                    }
                },
                "honours": {
                    "Advanced Science (Honours)": {
                        "notes": "Students must complete at least one Science Honours stream selected from the list below.",
                        "specs": {
                            "MATHPH": "Pure Mathematics",
                            "BIOTBH": "Biotechnology",
                            "CHEMFH": "Chemistry",
                            "SOMSEH": "Anatomy",
                            "MATHTH": "Statistics",
                            "MATHNH": "Physical Oceanography",
                            "MATHAH": "Applied Mathematics",
                            "SOMSDH": "Pathology",
                            "BABSBH": "Bioinformatics",
                            "CLIMDH": "Climate Science",
                            "SOMSAH": "Medical Science",
                            "PSYCAH": "Psychology",
                            "BIOCFH": "Molecular and Cell Biology",
                            "SOMSBH": "Physiology",
                            "MSCIJH": "Marine Science",
                            "ARCYBH": "Palaeoscience",
                            "VISNBH": "Vision Science",
                            "SOMSCH": "Pharmacology",
                            "GEOGTH": "Geography",
                            "PHYSGH": "Physics",
                            "GEOLMH": "Geology",
                            "BIOSLH": "Ecology",
                            "NEURBH": "Neuroscience",
                            "BIOCGH": "Genetics",
                            "MATSCH": "Materials Science",
                            "MICRFH": "Microbiology",
                            "BIOSKH": "Biology"
                        }
                    }
                }
            },
            "core_courses": [
                {
                    "courses": {
                        "SCIF1131": "Introductory Skills for Science"
                    },
                    "title": "Core Courses",
                    "credits_to_complete": 6,
                    "levels": [],
                    "notes": "Students must take 6 UOC of the following courses\nNote: Students in the Vision Science major should take VISN1101 Seeing the World Perspectives from Vision Science instead. Students in Engineering Dual Programs should take ENGG1000 Introduction to Engineering Design and Innovation."
                }
            ],
            "information_rules": [
                {
                    "title": "Double Counting",
                    "notes": "Students cannot complete a minor with the same name as their nominated major, and Level II and III courses cannot be double-counted between majors and minors. More than one minor may be completed subject to the limit on double-counting. Students must declare their minor(s) before their final semester."
                },
                {
                    "title": "3782 - COMP COURSE RULE",
                    "notes": "Students may not count 'COMP' courses towards their Science requirements unless they are specified as core courses in their major (i.e. for these students 'COMP' courses will not count as 'Science' courses)."
                }
            ],
            "limit_rules": [
                {
                    "courses": {
                        "AVIA3": "any level 3 Faculty of Science course",
                        "BABS3": "any level 3 Faculty of Science course",
                        "BEES3": "any level 3 Faculty of Science course",
                        "BIOC3": "any level 3 Faculty of Science course",
                        "BIOS3": "any level 3 Faculty of Science course",
                        "CHEM3": "any level 3 Faculty of Science course",
                        "CLIM3": "any level 3 Faculty of Science course",
                        "DATA3": "any level 3 Faculty of Science course",
                        "GENS3": "any level 3 Faculty of Science course",
                        "GEOS3": "any level 3 Faculty of Science course",
                        "MATH3": "any level 3 Faculty of Science course",
                        "MATS3": "any level 3 Faculty of Science course",
                        "MICR3": "any level 3 Faculty of Science course",
                        "MSCI3": "any level 3 Faculty of Science course",
                        "NANO3": "any level 3 Faculty of Science course",
                        "PHYS3": "any level 3 Faculty of Science course",
                        "PSYC3": "any level 3 Faculty of Science course",
                        "SCIF3": "any level 3 Faculty of Science course",
                        "COMP3": "any level 3 Computer Science course",
                        "FOOD3": "any level 3 Food Technology course",
                        "ANAT3": "any level 3 Anatomy course",
                        "NEUR3": "any level 3 Neuroscience course",
                        "PATH3": "any level 3 Pathology course",
                        "PHAR3": "any level 3 Pharmacology course",
                        "PHSL3": "any level 3 Physiology course",
                        "SOMS3": "any level 3 Medical Science course"
                    },
                    "title": "Minimum Level 3 Science UOC",
                    "credits_to_complete": 30,
                    "levels": [],
                    "notes": "Students must complete a minimum of 30 UOC of the following courses."
                },
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 UOC",
                    "credits_to_complete": 72,
                    "levels": [],
                    "notes": "A maximum of 72 UOC of Level 1 courses can be taken, including any General Education or mainstream Level 1 course taken to fulfil either the General Education or the Free Elective requirement."
                },
                {
                    "courses": {
                        "AVIA1": "any level 1 Faculty of Science course",
                        "BABS1": "any level 1 Faculty of Science course",
                        "BEES1": "any level 1 Faculty of Science course",
                        "BIOC1": "any level 1 Faculty of Science course",
                        "BIOS1": "any level 1 Faculty of Science course",
                        "CHEM1": "any level 1 Faculty of Science course",
                        "CLIM1": "any level 1 Faculty of Science course",
                        "DATA1": "any level 1 Faculty of Science course",
                        "GENS1": "any level 1 Faculty of Science course",
                        "GEOS1": "any level 1 Faculty of Science course",
                        "MATH1": "any level 1 Faculty of Science course",
                        "MATS1": "any level 1 Faculty of Science course",
                        "MICR1": "any level 1 Faculty of Science course",
                        "MSCI1": "any level 1 Faculty of Science course",
                        "NANO1": "any level 1 Faculty of Science course",
                        "PHYS1": "any level 1 Faculty of Science course",
                        "PSYC1": "any level 1 Faculty of Science course",
                        "SCIF1": "any level 1 Faculty of Science course",
                        "COMP1": "any level 1 Computer Science course",
                        "FOOD1": "any level 1 Food Technology course",
                        "ANAT1": "any level 1 Anatomy course",
                        "NEUR1": "any level 1 Neuroscience course",
                        "PATH1": "any level 1 Pathology course",
                        "PHAR1": "any level 1 Pharmacology course",
                        "PHSL1": "any level 1 Physiology course",
                        "SOMS1": "any level 1 Medical Science course"
                    },
                    "title": "Minimum Level 1 Science UOC",
                    "credits_to_complete": 24,
                    "levels": [],
                    "notes": "Students must complete a minimum of 24 UOC of the following courses."
                },
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 Electives UOC",
                    "credits_to_complete": 60,
                    "levels": [],
                    "notes": "Students may only undertake a maximum of 60 UOC of the following courses."
                }
            ],
            "prescribed_electives": [
                {
                    "courses": {
                        "ANAT": "any Anatomy course",
                        "CLIM": "any Faculty of Science course",
                        "MSCI": "any Faculty of Science course",
                        "PHAR": "any Pharmacology course",
                        "MATH": "any Faculty of Science course",
                        "BIOS": "any Faculty of Science course",
                        "BIOT": "any Biotechnology course",
                        "PHSL": "any Physiology course",
                        "VISN": "any Vision Science course",
                        "PHYS": "any Faculty of Science course",
                        "NEUR": "any Neuroscience course",
                        "CHEM": "any Faculty of Science course",
                        "GEOS": "any Faculty of Science course",
                        "BABS": "any Faculty of Science course",
                        "BIOC": "any Faculty of Science course",
                        "PSYC": "any Faculty of Science course",
                        "OPTM": "any Optometry course",
                        "AVIA": "any Aviation course",
                        "BEES": "any Biological, Earth & Environmental Science course",
                        "DATA": "any Faculty of Science course",
                        "GENS": "any Faculty of Science course",
                        "MATS": "any Materials Science and Engineering course",
                        "MICR": "any Microbiology course",
                        "NANO": "any Faculty of Science course",
                        "SCIF": "any Faculty of Science course",
                        "PATH": "any Pathology course",
                        "FOOD": "any Food Technology course",
                        "SOMS": "any Medical Science course"
                    },
                    "title": "Science Electives",
                    "credits_to_complete": 0,
                    "levels": [],
                    "notes": "Students need to complete 144 UOC to meet the core requirements for the Advanced Science (Honours) program. If SCIF1131 plus your choice of specialisation(s) requires less than 144\nUOC you are required to complete additional Science elective courses from the following list to meet the 144 UOC requirement."
                }
            ],
            "other": []
        },
        "processing_warnings": [
            "Couldn't find the number of credits for item in program Advanced Science (Honours) / Computer Science (3782) in section titled 'Science Electives'",
            "Couldn't find any of names (Advanced Science (Honours)) or (Computer Science) in program Advanced Science (Honours) / Computer Science (3782) in section titled '3782 - COMP COURSE RULE'"
        ]
    },
    "3783": {
        "title": "Computer Science / Arts",
        "code": "3783",
        "duration": 4,
        "UOC": 192,
        "faculty": "Faculty of Engineering",
        "overview": "The dual award BSc (Computer Science) BA enables students to complete the requirements of the BSc (Computer Science) and a Bachelor of Arts program from the Faculty of Arts and Social Sciences.\nFor admission to the program, students must satisfy the entry requirements for both the BSc (Computer Science) and the BA in the Faculty of Arts and Social Sciences. Students in this program must complete 192 units of credit of study.",
        "structure_summary": "Students must complete 192 UOC.\n1. A home major stream (60 UOC) 2. A minor stream (24 UOC) 3. Arts and Social Sciences Prescribed Electives (12 UOC) 4. Computer Science courses (96 UOC)",
        "components": {
            "general_education": {},
            "spec_data": {
                "majors": {
                    "Computer Science": {
                        "notes": "COMPA1 is the default stream, and will be used if no other stream is selected.",
                        "specs": {
                            "COMPJ1": "Computer Science (Programming Languages)",
                            "COMPD1": "Computer Science (Database Systems)",
                            "COMPE1": "Computer Science (eCommerce Systems)",
                            "COMPA1": "Computer Science",
                            "COMPY1": "Computer Science (Security Engineering)",
                            "COMPI1": "Computer Science (Artificial Intelligence)",
                            "COMPS1": "Computer Science (Embedded Systems)",
                            "COMPN1": "Computer Science (Computer Networks)"
                        }
                    }
                }
            },
            "core_courses": [],
            "information_rules": [
                {
                    "title": "Academic Writing & Language Enhancement",
                    "notes": "ARTS2050 Academic Writing for the Humanities (6 UOC) and HUMS1005 Personalised English Language Enhancement (6 UOC) can be counted as UNSW Arts and Social Sciences Prescribed Electives or Free Electives."
                }
            ],
            "limit_rules": [
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 Electives UOC",
                    "credits_to_complete": 60,
                    "levels": [],
                    "notes": "Students may only undertake a maximum of 60 UOC of the following courses."
                }
            ],
            "prescribed_electives": [
                {
                    "courses": {},
                    "title": "Arts and Social Sciences Prescribed Electives",
                    "credits_to_complete": 24,
                    "levels": [],
                    "notes": "You must complete 12 UOC of any courses offered by UNSW Arts and Social Sciences.\nIndigenous Studies courses (ATSIxxxx) cannot be studied as Arts and Social Sciences Prescribed Electives."
                }
            ],
            "other": []
        },
        "processing_warnings": [
            "Can't figure out what abbreviated code(s) are for Arts and Social Sciences in program Computer Science / Arts (3783) in section titled 'Arts and Social Sciences Prescribed Electives'"
        ]
    },
    "3784": {
        "title": "Commerce / Computer Science",
        "code": "3784",
        "duration": 4,
        "UOC": 192,
        "faculty": "UNSW Business School",
        "overview": "The dual degree program Bachelor of Commerce/Bachelor of Science (Computer Science) (BCom/BSc(Comp Sc)) degree provides the latest thinking in business and technology for today and the future. It offers excellent career options, equipping graduates with unique skill sets that can lead to a wide range of career opportunities.\nWhether you want to focus your career in computer science and also want the commercial skills that a business degree can give you, or you want a career in business with the added dimension of a computer science degree, then this dual degree gives you the flexibility to choose a program to meet your needs.",
        "structure_summary": "Students must complete 192 UOC.\nBachelor of Commerce (96 UOC)\n\nIntegrated First Year Courses (42 UOC) - 3784 students do not have to take COMM1110 as this requirement is satisfied in the Computer Science program\nmyBCom (0 UOC)\nCommerce major (48UOC): Students taking a combination of majors and/or minors that require both COMM1822 or INFS1603 and COMP3311 as core courses, should take only COMP3311, and replace COMM1822/INFS1603 with an additional major or minor elective.\nPrescribed Work Integrated Learning Course (Requirement can be satisfied by taking a Computer Science or Commerce WIL course)\nFinal Year Synthesis (0 - 6UOC)\nBusiness electives to make up to 96UOC Business School disciplinary requirement\n\nBachelor of Science in Computer Science (96 UOC)\n\nA Computer Science major\n\nFor any majors that require ECON1202, either MATH1131 or MATH1141 completed under the Computer Science component will act as substitute so student should not do ECON1202 but instead complete another Major elective to meet the 48UOC requirement.",
        "components": {
            "general_education": {},
            "spec_data": {
                "majors": {
                    "null": {
                        "notes": "COMPA1 is the default stream, and will be used if no other stream is selected.",
                        "specs": {
                            "COMPJ1": "Computer Science (Programming Languages)",
                            "COMPY1": "Computer Science (Security Engineering)",
                            "COMPI1": "Computer Science (Artificial Intelligence)",
                            "COMPE1": "Computer Science (eCommerce Systems)",
                            "COMPA1": "Computer Science",
                            "COMPN1": "Computer Science (Computer Networks)",
                            "COMPD1": "Computer Science (Database Systems)",
                            "COMPS1": "Computer Science (Embedded Systems)"
                        }
                    },
                    "Commerce": {
                        "notes": "Students must complete a 48 UOC within a specified discipline (Commerce major) with at least 18 UOC of Level 3 courses to meet program requirements. Please note, this 48 UOC includes 1 course from the Integrated First Year (IFY) core. This means that students will complete 42 UOC in specified disciplinary courses outside the IFY core.",
                        "specs": {
                            "MGMTJ1": "Innovation, Strategy and Entrepreneurship",
                            "IBUSA1": "International Business",
                            "INFSA1": "Information Systems",
                            "TABLC1": "Taxation",
                            "COMMJ1": "Business Analytics",
                            "FINSR1": "Financial Technology",
                            "ACCTA1": "Accounting",
                            "ECONF1": "Business Economics",
                            "ECONO1": "Behavioural Economics",
                            "MGMTH1": "Human Resource Management",
                            "FINSA1": "Finance",
                            "MARKA1": "Marketing"
                        }
                    }
                },
                "minors": {
                    "Commerce": {
                        "notes": "Students may choose to use their electives to complete one of the following minors.\nMinor Requirements: An approved disciplinary stream containing at least 18 UOC at Level 2 and Level 3.",
                        "specs": {
                            "MARKA2": "Marketing",
                            "ACCTA2": "Accounting",
                            "FINSA2": "Finance",
                            "MGMTA2": "Management",
                            "MGMTH2": "Human Resource Management",
                            "TABLC2": "Taxation",
                            "COMMJ2": "Business Analytics",
                            "INFSA2": "Information Systems",
                            "ECONF2": "Business Economics",
                            "TABLA2": "Business Law",
                            "FINSR2": "Financial Technology",
                            "IBUSA2": "International Business"
                        }
                    }
                }
            },
            "core_courses": [
                {
                    "courses": {
                        "COMM1180": "Value Creation",
                        "COMM1140": "Financial Management",
                        "COMM1190": "Data, Insights and Decisions",
                        "COMM1170": "Organisational Resources",
                        "COMM1150": "Global Business Environments",
                        "COMM1120": "Collaboration and Innovation in Business",
                        "COMM1100": "Business Decision Making",
                        "COMM1110": "Evidence-Based Problem Solving"
                    },
                    "title": "Integrated First Year Courses",
                    "credits_to_complete": 48,
                    "levels": [],
                    "notes": "Students must take 48 UOC of the following courses."
                },
                {
                    "courses": {
                        "COMM3030": "Social Entrepreneurship Practicum",
                        "TABL3033": "UNSW Tax and Business Advisory Clinic",
                        "COMM3900": "Capstone Project",
                        "COMM3090": "Synthesis of Learning Experience",
                        "COMM2244": "Future of Work Project",
                        "COMM2233": "Industry Consulting Project",
                        "COMM3020": "Global Business Practicum",
                        "ACCT3583": "Management Accounting 2",
                        "COMM3501": "Quantitative Business Analytics",
                        "ACTL3192": "Retirement Saving and Spending Over the Lifecycle",
                        "INFS3020": "International Information Systems and Technology Practicum",
                        "MGMT3004": "Solving Complex Strategy and Policy Problems",
                        "ECON3000": "Evidence-based Intervention Design and Evaluation"
                    },
                    "title": "Final Year Synthesis",
                    "credits_to_complete": 6,
                    "levels": [],
                    "notes": "Students must complete either a 6 UOC Synthesis of Learning Course, or a 0 UOC Synthesis Experience.\nStudents who complete a Synthesis course that is also a Work Integrated Learning course within a major, will meet a major elective, WIL and Synthesis requirement.\nStudents must complete their Final Year Synthesis course within their final year of their Bachelor of Commerce program. That is, within 48 UOC or less remaining in their BCom program."
                },
                {
                    "courses": {
                        "COMM3999": "myBCom Graduation Portfolio",
                        "COMM0999": "myBCom Blueprint",
                        "COMM1999": "myBCom First Year Portfolio"
                    },
                    "title": "myBCom",
                    "credits_to_complete": 0,
                    "levels": [],
                    "notes": "Students need to complete three non-credit bearing myBCom professional development elements. COMM0999 is recommended to be enrolled in the first term of study, COMM1999 upon completion of the integrated first year courses and COMM3999 in the final term of study. Students will engage in course Moodle activities as well as the myBCom platform (https://mybcom.unsw.edu.au/) to complete these elements."
                }
            ],
            "information_rules": [
                {
                    "title": "LEVEL 2 AND 3 MATURITY REQUIREMENTS",
                    "notes": "Student must have completed 24 UOC before taking any level 2 courses. Student must have completed 48 UOC before taking any level 3 courses."
                },
                {
                    "title": "3784 - Major Course Substitution",
                    "notes": "For any majors that require ECON1202, MATH1011/MATH1031/MATH1131/MATH1141/MATH1151 completed under the Computer Science component will act as substitute so student should not do ECON1202 but instead complete another Major elective to meet the 48 UOC requirement.\nStudents taking a combination of majors and/or minors that require both COMM1822 or INFS1603 and COMP3311 as core courses, should take only COMP3311, and replace COMM1822/INFS1603 with an additional major or minor elective."
                }
            ],
            "limit_rules": [
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 Electives UOC",
                    "credits_to_complete": 60,
                    "levels": [],
                    "notes": "Students may only undertake a maximum of 60 UOC of the following courses."
                },
                {
                    "courses": {
                        "GENC": "any UNSW Business School course"
                    },
                    "title": "Minimum Faculty UOC",
                    "credits_to_complete": 96,
                    "levels": [],
                    "notes": "Students must complete a minimum of 96 UOC of the following courses."
                }
            ],
            "prescribed_electives": [
                {
                    "courses": {
                        "COMM3202": "Industry Experience Placement 2",
                        "COMM3030": "Social Entrepreneurship Practicum",
                        "COMM2244": "Future of Work Project",
                        "COMM3020": "Global Business Practicum",
                        "COMM3101": "Industry Experience Placement 1",
                        "CDEV3000": "Practice of Work",
                        "COMM2233": "Industry Consulting Project",
                        "TABL3033": "UNSW Tax and Business Advisory Clinic",
                        "COMM2222": "Industry Experience Program"
                    },
                    "title": "Prescribed Work Integrated Learning (WIL) Course",
                    "credits_to_complete": 6,
                    "levels": [],
                    "notes": "Students must complete a 6 UOC Work Integrated Learning (WIL) course within their program. This course can count as a free elective or where applicable, can count as a Commerce major elective or General Education course. Note: Students in Commerce Double Degrees have the option of meeting the mandatory WIL requirement in the non-Commerce component of the Double Degree."
                }
            ],
            "other": []
        },
        "processing_warnings": [
            "Couldn't find any of names (Computer Science) or (Commerce) in program Commerce / Computer Science (3784) in section titled 'Disciplinary Component'",
            "Couldn't find any of names (Computer Science) or (Commerce) in program Commerce / Computer Science (3784) in section titled 'Maximum Level 1 Electives UOC'",
            "Couldn't find any of names (Computer Science) or (Commerce) in program Commerce / Computer Science (3784) in section titled 'Majors'",
            "Couldn't find the number of credits for item in program Commerce / Computer Science (3784) in section titled 'myBCom'",
            "Couldn't find any of names (Computer Science) or (Commerce) in program Commerce / Computer Science (3784) in section titled '3784 - Major Course Substitution'"
        ]
    },
    "3785": {
        "title": "Engineering (Honours) / Computer Science",
        "code": "3785",
        "duration": 5,
        "UOC": 240,
        "faculty": "Faculty of Engineering",
        "overview": "Students may seek to undertake a five-year full-time dual degree program leading to the award of the degrees of Bachelor of Engineering (Honours) and Bachelor of Science (Computer Science) (BE (Hons) BSc). The Faculty of Engineering administers the program, and delegates administration to the School which offers the Engineering discipline selected. Students should seek advice from the relevant School Office in the first instance, from the Faculty of Engineering, or from the School of Computer Science and Engineering for the Science component.\nWith this dual degree program, students take the 168 units of credit core of the Bachelor of Engineering (Honours) 3707 and the 96 units of credit core of the Bachelor of Science (Computer Science) program 3778. Because of the overlap of 24 units of credit of Science courses in both core, the total units of credit required for completion is 240 UOC, rather than 264 UOC (please see Academic Rules below for more details).",
        "structure_summary": "Students must complete 240 UOC (after the 24 UOC reduction from double counted courses).\nBachelor of Engineering (Hons) - 168 UOC\n\nA 168 UOC stream consisting of the following,\n\n\nAt least 48 UOC Disciplinary Knowledge and Enquiry-based Courses\n30-42 UOC Introductory Knowledge core courses\nAt least 12 UOC of elective courses\nThe balance of stream (specialisation/major) to consist of Foundation Disciplinary Knowledge courses\n6 UOC free elective\n\n\nStudents must also complete at least 60 days of approved Industrial Training experience\n\nBachelor of Computer Science\n96 UOC\n\nA Bachelor of Computer Science major\n6 UOC free elective\n\nBINFAH and COMPBH and SENGAH majors are not available in this double degree. This double degree also requires students to complete 12 UOC of Free Electives.\nIn this double degree students take 168 UOC for the Bachelor of Engineering (Hons) and 96 UOC for the Bachelor of Computer Science, for a total of 264 UOC. Because the courses required for both degrees overlap, the total minimum UOC required for the double degree is reduced by 24 UOC to 240 UOC.\nDepending on the chosen combination of Engineering stream and Computer Science major there may be more than 24 UOC of overlapping courses. When a student meets all the requirements for both degrees in less than 240 UOC, students must complete additional elective courses (on top of the required 12 UOC of free electives) to bring the total to 240 UOC. Students must take these additional electives from Faculty of Engineering and/or the School of Computer Science\nSome courses are double counted. Additionally the course overlaps require students to replace the usual course in one core or major with a more advanced course required in the other program. Specifically,\n\nStudents MUST take COMP1511 as their first year Engineering computing course, COMP1511 is then double counted towards both degrees\nCOMP1521 is a core requirement (BSc) and is double counted towards the BE(Hons) as a first year Engineering elective. Students should accordingly take one less first year Engineering elective\nStudents are required to complete one of MATH1131 or MATH1141, and one of MATH1231 or MATH1241. The two Maths course are double counted towards both degrees.\nCOMP4920 is required for the BSc, however students do not enrol in this course, and instead double count the management or ethics course in their chosen Engineering stream. Students take a free elective with the 6uoc freed up from not taking COMP4920\nMATH1081 is a core requirement (BSc) but is replaced by the 2nd year Maths course taken in the BE(Hons) major. Students take a free elective with the 6 UOC freed up from not taking MATH1081\n\nNote: Without following the substitutions above, students may end up needing to use free electives for core requirements or taking more than 240 UOC to complete the dual degree.",
        "components": {
            "general_education": {},
            "spec_data": {
                "majors": {
                    "Computer Science": {
                        "notes": "COMPA1 is the default stream, and will be used if no other stream is selected.",
                        "specs": {
                            "COMPD1": "Computer Science (Database Systems)",
                            "COMPS1": "Computer Science (Embedded Systems)",
                            "COMPA1": "Computer Science",
                            "COMPE1": "Computer Science (eCommerce Systems)",
                            "COMPI1": "Computer Science (Artificial Intelligence)",
                            "COMPY1": "Computer Science (Security Engineering)",
                            "COMPJ1": "Computer Science (Programming Languages)",
                            "COMPN1": "Computer Science (Computer Networks)"
                        }
                    }
                },
                "honours": {
                    "Engineering (Honours)": {
                        "notes": "Students must complete at least one of the specialisations below.",
                        "specs": {
                            "SOLABH": "Renewable Energy Engineering",
                            "PETRAH": "Petroleum Engineering",
                            "MINEAH": "Mining Engineering",
                            "GMATDH": "Surveying",
                            "SOLAAH": "Photovoltaics and Solar Energy",
                            "AEROAH": "Aerospace Engineering",
                            "CVENAH": "Civil Engineering",
                            "MTRNAH": "Mechatronic Engineering",
                            "CEICAH": "Chemical Engineering",
                            "GMATEH": "Geospatial Engineering",
                            "TELEAH": "Telecommunications",
                            "ELECAH": "Electrical Engineering",
                            "ELECCH": "Quantum Engineering",
                            "NAVLAH": "Naval Architecture",
                            "MANFBH": "Mechanical and Manufacturing Engineering",
                            "CVENBH": "Environmental Engineering",
                            "MECHAH": "Mechanical Engineering",
                            "CEICDH": "Chemical Product Engineering"
                        }
                    }
                }
            },
            "core_courses": [],
            "information_rules": [
                {
                    "title": "Industrial Experience Requirement",
                    "notes": "Students must complete a minimum of 60 days of Industrial Training to graduate. Industrial Training must be undertaken concurrently with enrolment in the program.\nFor more information on Industrial Training, please visit https://www.unsw.edu.au/engineering/student-life/industrial-training"
                }
            ],
            "limit_rules": [
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 Electives UOC",
                    "credits_to_complete": 60,
                    "levels": [],
                    "notes": "Students may only undertake a maximum of 60 UOC of the following courses."
                }
            ],
            "prescribed_electives": [],
            "other": []
        },
        "processing_warnings": []
    },
    "3786": {
        "title": "Computer Science / Law",
        "code": "3786",
        "duration": 5,
        "UOC": 240,
        "faculty": "Faculty of Law and Justice",
        "overview": "This Handbook is for commencing students. If you commenced in a prior year please refer to the Online Handbook in the year you started your Law degree or contact the Faculty of Law for advice.\nThis program combines the professional LLB program with a major in Computer Science offered within the School of Computer Science, Faculty of Engineering.\nDuration/Award The program is a five year full-time combined program leading to the award of the two degrees of Bachelor of Science (Computer Science) and Bachelor of Laws (BSc LLB).",
        "structure_summary": "Students must complete 240 UOC.\n1. Law compulsory courses - 96 UOC\n2. Law prescribed elective - 6 UOC\n3. Law elective courses - 42 UOC\n4. Computer Science courses - 96 UOC",
        "components": {
            "general_education": {},
            "spec_data": {
                "majors": {
                    "Computer Science": {
                        "notes": "COMPA1 is the default stream, and will be used if no other stream is selected.",
                        "specs": {
                            "COMPS1": "Computer Science (Embedded Systems)",
                            "COMPY1": "Computer Science (Security Engineering)",
                            "COMPD1": "Computer Science (Database Systems)",
                            "COMPE1": "Computer Science (eCommerce Systems)",
                            "COMPN1": "Computer Science (Computer Networks)",
                            "COMPA1": "Computer Science",
                            "COMPI1": "Computer Science (Artificial Intelligence)",
                            "COMPJ1": "Computer Science (Programming Languages)"
                        }
                    }
                }
            },
            "core_courses": [
                {
                    "courses": {
                        "LAWS1022": "Criminal Laws",
                        "LAWS1091": "Business Associations",
                        "LAWS2150": "Federal Constitutional Law",
                        "LAWS1075": "Contracts",
                        "LAWS1150": "Principles of Private Law",
                        "LAWS1141": "Principles of Public Law",
                        "LAWS1021": "Crime and the Criminal Process",
                        "LAWS2383": "Land Law",
                        "LAWS2385": "Equity and Trusts",
                        "LAWS1230": "Lawyers, Ethics and Justice",
                        "LAWS1061": "Torts",
                        "LAWS2371": "Resolving Civil Disputes",
                        "LAWS1160": "Administrative Law",
                        "LAWS1055": "Legal Research and Writing",
                        "LAWS2270": "Law in the Global Context",
                        "LAWS2351": "Court Process, Evidence and Proof",
                        "LAWS1052": "Introducing Law and Justice"
                    },
                    "title": "Core Courses",
                    "credits_to_complete": 96,
                    "levels": [],
                    "notes": "Students must take 96 UOC of the following courses."
                }
            ],
            "information_rules": [
                {
                    "title": "Nura-Gili Pre-Law Program",
                    "notes": "Indigenous students who have entered the Bachelor of Law program through the Nura Gili Pre-Law program must complete the following two courses (6 UOC): - LAWS1213 Foundations Enrichment 1 (3 UOC) - LAWS1214 Foundations Enrichment 2 (3 UOC) These courses are taken in place of 6 UOC of electives and are not available to other students."
                }
            ],
            "limit_rules": [
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 Electives UOC",
                    "credits_to_complete": 60,
                    "levels": [],
                    "notes": "Students may only undertake a maximum of 60 UOC of the following courses."
                }
            ],
            "prescribed_electives": [
                {
                    "courses": {
                        "LAWS3789": "Policing",
                        "LAWS3073": "Cities, Planning, Law and Justice",
                        "LAWS3812": "Sport and the Law",
                        "LAWS3332": "Law and Social Theory",
                        "LAWS3713": "Indigenous Peoples in International Law",
                        "LAWS3341": "Gender and Law",
                        "LAWS3346": "Law and Technology: Comparative Perspectives (UNSW/UZH)",
                        "LAWS3541": "Pacific Islands Laws (USP)",
                        "LAWS3017": "The Politics of Human Rights: Theory and Critique",
                        "LAWS3165": "Islamic Law and Society",
                        "LAWS3623": "The Criminal Trial",
                        "LAWS3146": "Human Rights Law (New York)",
                        "LAWS3300": "Housing Clinic (Redfern Legal Centre)",
                        "LAWS3102": "Advanced Criminal Law",
                        "LAWS3305": "Kingsford Legal Centre Employment Law Clinic (Intensive)",
                        "LAWS3147": "Elements of Income Tax Law",
                        "LAWS3326": "Theories of Law and Justice",
                        "LAWS3425": "Research Thesis",
                        "LAWS3221": "Media Law: General Principles",
                        "LAWS3105": "Penology",
                        "LAWS3589": "Class Actions and Mega-Litigation",
                        "LAWS3152": "Advanced Revenue Law",
                        "LAWS3182": "International Human Rights Law and Advocacy",
                        "LAWS3382": "Conflict of Laws",
                        "LAWS3130": "Administrative Justice",
                        "LAWS3335": "Economic Analysis of Law",
                        "LAWS3040": "Regulation for Cyber Security",
                        "LAWS3302": "Land and Environment Court Clinic",
                        "LAWS3135": "Land Dealings: Residential and Commercial Contracts",
                        "LAWS3183": "Australian Journal of Human Rights",
                        "LAWS3014": "Insolvency Law",
                        "LAWS3084": "International Trade Law: The Law and Policy of the WTO",
                        "LAWS3086": "International Law Competitive Moot",
                        "LAWS3524": "Indigenous Women and the Law",
                        "LAWS3142": "Conceptual Framework of the Common Law",
                        "LAWS3758": "Roman Law",
                        "LAWS3144": "Animal Law",
                        "LAWS3513": "Indigenous Children and the Law",
                        "LAWS3028": "Employment Law",
                        "LAWS3018": "Commercial Law",
                        "LAWS3381": "Public International Law",
                        "LAWS3167": "The Rule of Law in Asia",
                        "LAWS3125": "Criminal Process and Human Rights",
                        "LAWS3196": "Designing Technology Solutions for Access to Justice",
                        "LAWS3384": "Legal Experimentalism",
                        "LAWS3064": "UNSW Law Journal (Executive Editor)",
                        "LAWS3331": "Legal Theory",
                        "LAWS3319": "Police Powers Clinic",
                        "LAWS3155": "Responses to Corporate Wrongdoing",
                        "LAWS3281": "Advanced Statutory Interpretation",
                        "LAWS3248": "Intellectual Property 2: Trade Marks and Patents",
                        "LAWS3276": "Sir Anthony Mason Research Project in Constitutional Law",
                        "LAWS3348": "Transitional Justice (South America)",
                        "LAWS3401": "Health and Medical Law",
                        "LAWS3510": "International Commercial Mediation Competition",
                        "LAWS3181": "International Humanitarian Law",
                        "LAWS3445": "Women and Gender Law ILS Pune",
                        "LAWS3231": "Work Health and Safety Law",
                        "LAWS3185": "Public Interest Litigation: Origins and Strategies",
                        "LAWS1213": "Foundations Enrichment 1",
                        "LAWS3188": "Settlement of International Disputes",
                        "LAWS3080": "Insurance in Australia",
                        "LAWS3412": "Discrimination and the Law",
                        "LAWS3512": "Native Title Law, Policy and Practice",
                        "LAWS3141": "Securities and Financial Services Regulation",
                        "LAWS3301": "Remedies",
                        "LAWS3427": "Drug Law and Policy",
                        "LAWS3413": "Housing Law",
                        "LAWS3434": "Research Thesis: Extended",
                        "LAWS3192": "Takeovers and Capital Markets Law",
                        "LAWS3309": "Human Rights Clinic (Intensive)",
                        "LAWS3393": "Succession",
                        "LAWS3023": "Commercial and Charitable Trusts",
                        "LAWS3072": "Corporate Misconduct and White Collar Crime",
                        "LAWS3327": "Law Schools Global League Summer School",
                        "LAWS3423": "Research Thesis",
                        "LAWS3115": "People, Land and Community",
                        "LAWS3021": "Foundations of Intellectual Property Law",
                        "LAWS3478": "Theft, Fraud and Corruption",
                        "LAWS3292": "The High Court of Australia",
                        "LAWS3137": "Australian Consumer Law",
                        "LAWS3212": "Indigenous Law Centre Student Editor",
                        "LAWS3391": "Family Law",
                        "LAWS3186": "Human Rights Defender",
                        "LAWS3187": "Forced Migration and Human Rights in International Law",
                        "LAWS3150": "Contemporary Constitutional Law",
                        "LAWS3159": "International and Comparative Law Workshop",
                        "LAWS3282": "Advanced Administrative Law",
                        "LAWS3442": "The Will of the People",
                        "LAWS3549": "Child Rights Comparative Clinical Program: India",
                        "LAWS3060": "Human Rights Clinic (Non-intensive)",
                        "LAWS3392": "Children and the Law",
                        "LAWS1214": "Foundations Enrichment 2",
                        "LAWS3394": "Families, Property & Death",
                        "LAWS3149": "Theories of Law and Biology",
                        "LAWS3079": "Restitution",
                        "LAWS3123": "Chinese Legal System (SJTU)",
                        "LAWS3070": "International Investment Law and Policy",
                        "LAWS3314": "Alternative Dispute Resolution in Practice",
                        "LAWS3133": "Law of Banking",
                        "LAWS3303": "Kingsford Legal Centre Community Law Clinic (Intensive)",
                        "LAWS3046": "Intellectual Property 1: Copyright and Designs",
                        "LAWS3304": "Kingsford Legal Centre Community Law Clinic (Non-intensive)",
                        "LAWS3354": "International Trade Remedies: Law and Practices",
                        "LAWS3345": "CIBEL Elective (Tsinghua)",
                        "LAWS3272": "Australian Immigration Law and Practice",
                        "LAWS3170": "The Essential Advocate:An Intro to Advocacy",
                        "LAWS3025": "Advanced Contract Law",
                        "LAWS3131": "Information Technology Law",
                        "LAWS3240": "Kingsford Legal Centre Family Law Community Education Clinic (Non-Intensive)",
                        "LAWS3555": "UNSW Law Internships",
                        "LAWS3600": "Housing Clinic (Redfern Legal Centre) Intensive",
                        "LAWS3441": "Law Journal (Issue Editor)",
                        "LAWS3211": "Indigenous People and the Law",
                        "LAWS3067": "International Criminal Law",
                        "LAWS3087": "US Legal Systems (Berkeley)",
                        "LAWS3139": "Indonesian Law",
                        "LAWS3157": "Chinese Regulation of International Business",
                        "LAWS3396": "Family Law Advocacy and Practice",
                        "LAWS3316": "Expert Evidence",
                        "LAWS3361": "Environmental Law",
                        "LAWS3251": "Australian Legal History - Before and After the First Fleet",
                        "LAWS3751": "Business Taxation",
                        "LAWS3402": "The Law of Politics",
                        "LAWS3195": "Anti-Terrorism Law, Criminal Justice and Human Rights",
                        "LAWS3216": "Food Law",
                        "LAWS3383": "Legal Aid and Global Justice Lawyering: Issues in Practice",
                        "LAWS3047": "Australian Bills of Rights and the Protection of Human Rights",
                        "LAWS3057": "Advanced Intellectual Property Policy and Practice",
                        "LAWS3395": "Interpretation of Contracts",
                        "LAWS3022": "Competition Law",
                        "LAWS3222": "Communications Law",
                        "LAWS3065": "UNSW Law Journal Editor",
                        "LAWS3019": "Financial Economics and Law"
                    },
                    "title": "Law Elective Courses",
                    "credits_to_complete": 42,
                    "levels": [],
                    "notes": "Students must complete 42 UOC of Law Electives.\nNote: With the permission of the Director of Undergraduate Studies and the course teacher, undergraduate students may enrol in one or more Postgraduate courses, in a select list of approved Postgraduate Electives. Not more than half the students' total elective courses may be taken from the postgraduate offerings."
                },
                {
                    "courses": {
                        "LAWS2320": "Legal Theory",
                        "LAWS2384": "Legal Experimentalism",
                        "LAWS2820": "Law and Social Theory",
                        "LAWS2326": "Theories of Law and Justice"
                    },
                    "title": "Prescribed Theory Electives",
                    "credits_to_complete": 6,
                    "levels": [],
                    "notes": "Students must take 6 UOC of the following courses"
                }
            ],
            "other": []
        },
        "processing_warnings": []
    },
    "3789": {
        "title": "Science / Computer Science",
        "code": "3789",
        "duration": 4,
        "UOC": 192,
        "faculty": "Faculty of Engineering",
        "overview": "With this dual degree program, students can add a Science program to the standard, professionally accredited BSc in Computer Science program offered by the School of Computer Science and Engineering. All Science majors within program 3970 are available.\nStudents who meet the entry requirements for the BSc in Computer Science program 3778 and for the Bachelor of Science program 3970 may apply to enter the combined Bachelor of Science Bachelor of Science (Computer Science) program.\nStudents should schedule the Science and Computer Science components to suit their preferences while meeting constraints of timetables and prerequisites. The Science Faculty section in this Handbook describes the Science options and the School of Computer Science and Engineering Student Office can supply sample programs indicating what previous students have arranged.\nIn addition to the BSc in Computer Science program 3778, students must complete a minimum of 96 units of credit in Science courses, including a major sequence in an approved area. The Science office must approve the Science component while the School of Computer Science and Engineering will approve the final program and schedule.",
        "structure_summary": "Students must complete 192 UOC.\nBachelor of Science (96 UOC)\n\nAn approved Bachelor of Science major; and\nScience elective courses\n\nBachelor of Science (Computer Science) (96 UOC)\n\nA Bachelor of Computer Science major; and\nComputer Science elective courses\n\nIn this dual degree students take 96 UOC for the Bachelor of Science, and 96 UOC for the Bachelor of Computer, for a total of 192 UOC. The Science courses required for both degrees can overlap. Depending on the chosen combination of Computer Science major and Science major, there may be varying amounts of overlapping courses. When a student meets all the requirements for both degrees in less than 192 UOC, students must complete additional elective courses to bring the total to 192 UOC.",
        "components": {
            "general_education": {},
            "spec_data": {
                "minors": {
                    "Science": {
                        "notes": "Students may choose to complete an optional minor in one of the following areas, using their Science and/or free electives.",
                        "specs": {
                            "GEOGH2": "Physical Geography",
                            "GEOLF2": "Geology",
                            "ANATB2": "Anatomy",
                            "PHARB2": "Pharmacology",
                            "CLIMA2": "Climate Science",
                            "ARCYB2": "Palaeosciences",
                            "MATHD2": "Statistics",
                            "MSCIH2": "Marine Science",
                            "BIOSD2": "Biology",
                            "PHSLB2": "Physiology",
                            "PATHB2": "Pathology",
                            "MATHC2": "Mathematics",
                            "PHYSC2": "Physics",
                            "MICRJ2": "Immunology",
                            "VISNB2": "Vision Science",
                            "PSYCM2": "Psychology",
                            "BIOCD2": "Molecular Biology",
                            "CHEMD2": "Chemistry"
                        }
                    }
                },
                "majors": {
                    "Science": {
                        "notes": "Students must complete at least one Science major selected from the list below. Students should declare their major prior to commencing Stage 2 courses.\nNotes: 1.Students are not permitted to take the Bioinformatics major BINFB1 when taking the degree in dual award mode with the Bachelor of Engineering (Bioinformatics) program.",
                        "specs": {
                            "PHARA1": "Pharmacology",
                            "PHSLA1": "Physiology",
                            "PATHA1": "Pathology",
                            "BIOCM1": "Molecular and Cell Biology",
                            "MSCIM1": "Marine and Coastal Science",
                            "GEOLS1": "Earth Science",
                            "GEOGG1": "Geography",
                            "MATHM1": "Mathematics",
                            "FOODH1": "Food Science",
                            "MATHT1": "Statistics",
                            "BIOCC1": "Genetics",
                            "PSYCA1": "Psychology",
                            "MICRB1": "Microbiology",
                            "NEURS1": "Neuroscience",
                            "BIOTA1": "Biotechnology",
                            "MICRJ1": "Immunology",
                            "CHEMA1": "Chemistry",
                            "PHYSL1": "Physics",
                            "BINFB1": "Bioinformatics",
                            "MATHN1": "Physical Oceanography",
                            "BIOSJ1": "Biology",
                            "ANATA1": "Anatomy",
                            "BIOSG1": "Ecology",
                            "VISNA1": "Vision Science",
                            "MATSB1": "Materials Science"
                        }
                    },
                    "Computer Science": {
                        "notes": "COMPA1 is the default stream, and will be used if no other stream is selected.",
                        "specs": {
                            "COMPJ1": "Computer Science (Programming Languages)",
                            "COMPD1": "Computer Science (Database Systems)",
                            "COMPN1": "Computer Science (Computer Networks)",
                            "COMPS1": "Computer Science (Embedded Systems)",
                            "COMPA1": "Computer Science",
                            "COMPE1": "Computer Science (eCommerce Systems)",
                            "COMPY1": "Computer Science (Security Engineering)",
                            "COMPI1": "Computer Science (Artificial Intelligence)"
                        }
                    }
                }
            },
            "core_courses": [],
            "information_rules": [
                {
                    "title": "3789 - COMP Course Rule",
                    "notes": "Students in the Bachelor of Science/Bachelor of Science (Computer Science) dual degree may not count 'COMP' courses towards their Science requirements unless they are specified as core courses in their major (i.e. for these students 'COMP' courses will not count as 'Science' courses)."
                },
                {
                    "title": "Double Counting",
                    "notes": "Students cannot complete a minor with the same name as their nominated major, and Level II and III courses cannot be double-counted between majors and minors. More than one minor may be completed subject to the limit on double-counting. Students must declare their minor(s) before their final term."
                }
            ],
            "limit_rules": [
                {
                    "courses": {
                        "AVIA1": "any level 1 Faculty of Science course",
                        "BABS1": "any level 1 Faculty of Science course",
                        "BEES1": "any level 1 Faculty of Science course",
                        "BIOC1": "any level 1 Faculty of Science course",
                        "BIOS1": "any level 1 Faculty of Science course",
                        "CHEM1": "any level 1 Faculty of Science course",
                        "CLIM1": "any level 1 Faculty of Science course",
                        "DATA1": "any level 1 Faculty of Science course",
                        "GENS1": "any level 1 Faculty of Science course",
                        "GEOS1": "any level 1 Faculty of Science course",
                        "MATH1": "any level 1 Faculty of Science course",
                        "MATS1": "any level 1 Faculty of Science course",
                        "MICR1": "any level 1 Faculty of Science course",
                        "MSCI1": "any level 1 Faculty of Science course",
                        "NANO1": "any level 1 Faculty of Science course",
                        "PHYS1": "any level 1 Faculty of Science course",
                        "PSYC1": "any level 1 Faculty of Science course",
                        "SCIF1": "any level 1 Faculty of Science course"
                    },
                    "title": "Level 1 Science UOC",
                    "credits_to_complete": 24,
                    "levels": [],
                    "notes": "Students must complete a minimum of 24 UOC of the following courses."
                },
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 UOC",
                    "credits_to_complete": 72,
                    "levels": [],
                    "notes": "A maximum of 72 UOC of Level 1 courses can be taken, including any General Education or mainstream Level 1 course taken to fulfil either the General Education or the Free Elective requirement."
                },
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 Electives UOC",
                    "credits_to_complete": 60,
                    "levels": [],
                    "notes": "Students may only undertake a maximum of 60 UOC of the following courses."
                }
            ],
            "prescribed_electives": [
                {
                    "courses": {
                        "BIOT": "any Biotechnology course",
                        "CLIM": "any Faculty of Science course",
                        "PATH": "any Pathology course",
                        "AVIA": "any Faculty of Science course",
                        "MATS": "any Faculty of Science course",
                        "PHYS": "any Faculty of Science course",
                        "BIOS": "any Faculty of Science course",
                        "PHAR": "any Pharmacology course",
                        "CHEM": "any Faculty of Science course",
                        "OPTM": "any Optometry course",
                        "ANAT": "any Anatomy course",
                        "MATH": "any Faculty of Science course",
                        "GEOS": "any Faculty of Science course",
                        "BABS": "any Biotechnology & Biomolecular Sciences course",
                        "BEES": "any Biological, Earth & Environmental Science course",
                        "BIOC": "any Biochemistry course",
                        "DATA": "any Faculty of Science course",
                        "GENS": "any Faculty of Science course",
                        "MICR": "any Microbiology course",
                        "MSCI": "any Marine Science course",
                        "NANO": "any Faculty of Science course",
                        "PSYC": "any Psychology course",
                        "SCIF": "any Faculty of Science course",
                        "VISN": "any Vision Science course",
                        "PHSL": "any Physiology course",
                        "SOMS": "any Medical Science course",
                        "FOOD": "any Food Technology course",
                        "NEUR": "any Neuroscience course"
                    },
                    "title": "Science Electives",
                    "credits_to_complete": 36,
                    "levels": [],
                    "notes": "Students need to complete 96 UOC to meet the core requirements for the Bachelor of Science. If your choice of specialisation(s) requires less than 96 UOC you are required to complete additional Science elective courses from the following list to meet the 96 UOC requirement."
                }
            ],
            "other": []
        },
        "processing_warnings": [
            "Couldn't find any of names (Computer Science) or (Science) in program Science / Computer Science (3789) in section titled '3789 - COMP Course Rule'"
        ]
    },
    "3791": {
        "title": "Computer Science / Media Arts",
        "code": "3791",
        "duration": 4,
        "UOC": 192,
        "faculty": "Faculty of Engineering",
        "overview": "The Computer Science / Media Arts dual award provides both a technical and creative foundation to the development and use of computer graphics. It also allows specialisation in the final semester in either the technical or creative strand of computer graphics and associated fields.",
        "structure_summary": "Students must complete 192 UOC.",
        "components": {
            "general_education": {},
            "spec_data": {
                "majors": {
                    "Computer Science": {
                        "notes": "COMPA1 is the default stream, and will be used if no other stream is selected.",
                        "specs": {
                            "COMPI1": "Computer Science (Artificial Intelligence)",
                            "COMPE1": "Computer Science (eCommerce Systems)",
                            "COMPS1": "Computer Science (Embedded Systems)",
                            "COMPN1": "Computer Science (Computer Networks)",
                            "COMPA1": "Computer Science",
                            "COMPJ1": "Computer Science (Programming Languages)",
                            "COMPD1": "Computer Science (Database Systems)",
                            "COMPY1": "Computer Science (Security Engineering)"
                        }
                    }
                }
            },
            "core_courses": [
                {
                    "courses": {
                        "DART3201": "Media Arts Project 2",
                        "DART1201": "Media Arts Gateway 2",
                        "DART1200": "Media Arts Gateway 1",
                        "DART3200": "Media Arts Project 1",
                        "DART3203": "Professional Practice",
                        "DART1350": "Media Arts Histories",
                        "DART1351": "Critical Discourses in Media Arts"
                    },
                    "title": "Core Courses",
                    "credits_to_complete": 42,
                    "levels": [],
                    "notes": "Students must take 42 UOC of the following courses."
                },
                {
                    "courses": {
                        "ADAD3000": "Professional Experience Project",
                        "DART23": "any course matching the pattern DART23##",
                        "DART33": "any course matching the pattern DART33##",
                        "DART13": "any course matching the pattern DART13##"
                    },
                    "title": "Core Theory Options",
                    "credits_to_complete": 18,
                    "levels": [],
                    "notes": "Students must take 18 UOC of the following courses."
                }
            ],
            "information_rules": [],
            "limit_rules": [
                {
                    "courses": {
                        "....1": "any level 1 course"
                    },
                    "title": "Maximum Level 1 Electives UOC",
                    "credits_to_complete": 60,
                    "levels": [],
                    "notes": "Students may only undertake a maximum of 60 UOC of the following courses."
                }
            ],
            "prescribed_electives": [
                {
                    "courses": {
                        "DART2221": "Visual Effects 3",
                        "DART1220": "Visual Effects 1",
                        "DART2220": "Visual Effects 2",
                        "DART1230": "Moving Image 1",
                        "DART2231": "Moving Image 3: Advanced Practice",
                        "DART2230": "Moving Image 2: Studio Processes",
                        "DDES1110": "3D Visualisation 1: 3D Virtual Objects",
                        "DDES2111": "3D Visualisation 3: Interactive Environments",
                        "DDES2110": "3D Visualisation 2: Virtual Worlds",
                        "DART2240": "Sound 2",
                        "DART1240": "Sound 1",
                        "DART2241": "Sound 3",
                        "DART1210": "Animation 1",
                        "DART2210": "Animation 2",
                        "DART2211": "Animation 3"
                    },
                    "title": "Media Arts Disciplinary Studios",
                    "credits_to_complete": 36,
                    "levels": [],
                    "notes": "Students must complete 36 UOC in approved disciplinary studio courses which must include 12 UOC at introductory level, 12 UOC at intermediate level and 12 UOC at advanced level from the studio courses below.\nStudents must take 2 sequences, as set out below, of 18 UOC each."
                }
            ],
            "other": []
        },
        "processing_warnings": []
    },
    "4515": {
        "title": "Computer Science & Engineering (Honours)",
        "code": "4515",
        "duration": 1,
        "UOC": 48,
        "faculty": "Faculty of Engineering",
        "overview": "The Bachelor of Science (Honours) program in Computer Science and Engineering is a 1 year full-time or 2 year part-time award undertaken by eligible students after completion of a 3 year Bachelor of Science program in a relevant discipline and offers students an opportunity to deepen their understanding of the discipline through the completion of advanced coursework and a research thesis.\nThe goals of the program are to:\nProvide advanced training to enable graduates to competently undertake sophisticated computing tasks in industry and commerce.\nProvide investigative academic training in preparation for undertaking postgraduate research, through Masters and PhD programs.\nIn attaining these goals the following objectives are considered important:\nTo expand the scope and depth of training, by coursework, in chosen areas.\nTo foster the development of personal initiative and group interaction by encouraging individual and cooperative investigation of topics of interest.\nTo foster the development of creativity and project management by the planning and undertaking of significant project work in the form of a research thesis.\nTo promote the development of verbal and written presentation skills.\nTo provide an environment for open and free enquiry based on the accepted tenets of academic scepticism.\nTo expose students to the rigour and excitement of novel enquiry.",
        "structure_summary": "Students must complete 48 UOC when taken as a standalone program.\nStudents must complete the following:\n\n\n\t COMP4961 Computer Science Thesis A (6 UOC)\n\t COMP4962&nbsp;Computer Science Thesis B&nbsp;(6 UOC)\n\t COMP4963&nbsp;Computer Science Thesis C (6 UOC)\n\t COMP electives level 4 or higher (30 UOC)",
        "components": {
            "general_education": {},
            "spec_data": {
                "honours": {
                    "Computer Science & Engineering (Honours)": {
                        "notes": "Students must complete at least one of the specialisations below.",
                        "specs": {
                            "COMPAH": "Computer Science",
                            "BINFBH": "Computational Biology"
                        }
                    }
                }
            },
            "core_courses": [],
            "information_rules": [],
            "limit_rules": [],
            "prescribed_electives": [],
            "other": []
        },
        "processing_warnings": []
    },
    "7003": {
        "title": "Computer Science",
        "code": "7003",
        "duration": 1,
        "UOC": 48,
        "faculty": "UNSW Global",
        "overview": "This 11 month program will provide students with the opportunity to pursue a degree in Computer Science that will lead to a career in a discipline of Computer Science or related area. Students will complete a set of seven science and engineering courses in addition to a set of Communication and Academic Literacy courses (total of 6 UOC). Credit will be granted towards the Bachelor of Computer Science for each of the seven science and engineering courses which are all equivalent to First-Year UNSW courses and for the Communication and Academic Literacy courses. After successful completion of all eight courses, students will receive advanced standing equivalent to one year (48 UOC) towards their degree program and move into the Bachelor of Computer Science at UNSW Sydney.\nIn this Diploma program students will be able to experience a university environment and university life, while being supported to acquire all of the knowledge and skills needed for successful transition to undergraduate studies at UNSW. Students receive a solid background in science through their science courses, while some of the engineering courses they may choose provide them with the opportunity to engage in real-life situations including the design and construction of engineering prototypes. The courses in this program are equivalent in content and outcomes to First-Year UNSW courses but the delivery pace is slower and the face-to-face contact hours are greater. The course structure allows students to get accustomed to University learning styles - in Lectures, Laboratories, and Problem-Solving Workshops - while receiving additional support, as required, for the duration of the diploma program.",
        "structure_summary": "Students must complete 48 UOC when taken as a standalone program.\n1. Communication and Academic Literacy Core Course (6 UOC) 2. Core Courses (24 UOC) 3. Prescribed Electives (18 UOC)",
        "components": {
            "general_education": {},
            "spec_data": {},
            "core_courses": [
                {
                    "courses": {
                        "DPGE1002": "Communication and Academic Literacy 2",
                        "DPGE1001": "Communication and Academic Literacy 1",
                        "DPGE1003": "Communication and Academic Literacy 3"
                    },
                    "title": "Communication and Academic Literacy Core Courses",
                    "credits_to_complete": 6,
                    "levels": [],
                    "notes": "Students must take the following courses.\nThe course is separated into 3 components because it is taught over 3 terms."
                },
                {
                    "courses": {
                        "DPST1091": "Introduction to Programming",
                        "DPST1014": "Mathematics 1B",
                        "DPST1092": "Computer Systems Fundamentals",
                        "DPST1013": "Mathematics 1A"
                    },
                    "title": "Core Courses",
                    "credits_to_complete": 24,
                    "levels": [],
                    "notes": "Students must take 24 UOC of the following courses."
                }
            ],
            "information_rules": [],
            "limit_rules": [],
            "prescribed_electives": [
                {
                    "courses": {
                        "DPST1024 or DPST1022": [
                            "Higher Physics 1B",
                            "Physics 1B"
                        ],
                        "DPST1051": "Molecules, Cells and Genes",
                        "DPST1071": "Introduction to Engineering Design and Innovation",
                        "DPST1052": "Applied Biomolecular Sciences",
                        "DPST1023 or DPST1021": [
                            "Higher Physics 1A",
                            "Physics 1A"
                        ]
                    },
                    "title": "Prescribed Electives",
                    "credits_to_complete": 18,
                    "levels": [],
                    "notes": "Students must take 18 UOC (3 courses) from the following course list.\nNote: Students can only take Higher Physics 1B if they have passed Higher Physics 1A or achieved a minimum of 65% in the Physics 1A course."
                }
            ],
            "other": []
        },
        "processing_warnings": []
    },
    "7022": {
        "title": "Computer Science",
        "code": "7022",
        "duration": 0,
        "UOC": 24,
        "faculty": "Faculty of Engineering",
        "overview": "Computer Science involves the study of the design, construction and uses of computer systems. It is concerned with the representation of data and data structures in computer systems and the design of algorithms for automatic manipulation of this information by programming languages and machine systems\nThe undergraduate certificate in Computer Science provides you with a solid foundation in Computer Science concepts. You will learn about the fundamentals of programming and computer systems, and gain an understanding of some of the mathematical underpinnings of Computer Science. It will equip you to apply that understanding to write software and solve problems.\nOn successful completion of the certificate, you can transfer your completed courses and continue your studies in the Bachelor of Computer Science, subject to meeting the articulation requirements.\nNOTE:\nThis program does not have CRICOS registration; it is not available for study on a Student Visa.",
        "structure_summary": "Students must complete 24 UOC when taken as a standalone program.",
        "components": {
            "general_education": {},
            "spec_data": {},
            "core_courses": [
                {
                    "courses": {
                        "COMP1521": "Computer Systems Fundamentals",
                        "COMP2521": "Data Structures and Algorithms",
                        "COMP1511": "Programming Fundamentals"
                    },
                    "title": "Core Courses",
                    "credits_to_complete": 24,
                    "levels": [],
                    "notes": "Students must complete 24 UOC of the following\ncourses.\n*Note: Students who complete MATH1011 and articulate to the BSc in Computer Science will have that course count towards free elective requirements. Students will still need to complete MATH1131 or MATH1141 towards BSc in Computer Science requirements."
                }
            ],
            "information_rules": [],
            "limit_rules": [],
            "prescribed_electives": [],
            "other": []
        },
        "processing_warnings": []
    }
}